#ifndef _GCFL_OBJECT_
#define _GCFL_OBJECT_

//-----------------------------------------------
//GCFL -- Generic Classes and Functions Library
// Библиотека основных классов и функций
//Версия файла: 20100626
//Автор: Альданис Темнолесный (Aldanis Darkwood)
//-----------------------------------------------

//-----------------------------------------------
//gcObject -- Основной класc всех обьектов GCFL. Используется
// для контроля выделения памяти и правильного вызова
// конструкторов и деструкторов для производимых класов.
//-----------------------------------------------

class gcObject
{
public:
  gcObject();
  virtual ~gcObject();
};

#endif //_GCFL_OBJECT_
